// See https://aka.ms/new-console-template for more information
// Code-runner 실행 오류나면 설정에서 "csharp": "cd $dir && dotnet run"로 바꿀 것

/*
1. 유니티 화면
기본 인터페이스는 4개 창으로 구성 :
project (그래픽, 사운드)
hierarchy (게임 오브젝트)
scene (게임 오브젝트가 보이는 장면)
inspector (오브젝트 속성 확인 가능)


2. 큐브
오브젝트에다 Q 누르고 마우스 드래그하면 화면 이동
오브젝트에다 W 누르면 큐브 내부의 수직 커서 (기즈모)가 나옴
오브젝트에다 E 누르면 구 모양의 기즈모가 나와서 회전시킬 수 있음
오브젝트에다 R 누르면 크기 늘리거나 줄일 수 있음
오브젝트에다 T 누르면 마찬가지로 크기 변환이나 3D보다는 2D에서 많이 쓰임


3. 카메라
마우스 우클릭하면 카메라 회전 가능 (고정된 상태)
ALT 누르면서 마우스 우클릭하고 드래그하면 사물을 기준으로 카메라 이동
키보드 상하좌우로는 카메라 이동 가능
마우스휠로는 카메라 줌 가능


4. 유니티 기본 시스템
연극 > 막 > 인물&소품 > 대본과 같이 유니티에서도
게임 > 장면 > 오브젝트 > 스크립트가 존재함



*/
